# SetPoissonRatio Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..SetPoissonRatio Method
StructuralAsset Class See Also
---
Sets the Poisson ratio of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetPoissonRatio(
	double poissonRatio
)
```

Visual Basic
---
```text
Public Sub SetPoissonRatio ( _
	poissonRatio As Double _
)
```

Visual C++
---
```text
public:
void SetPoissonRatio(
	double poissonRatio
)
```

# ### Parameters
poissonRatio
    Type: System..::..Double
# Remarks
The Poisson ratio is one-dimensional for wood-based and isotropic materials. This method sets the x, y, and z components to the same value.
# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace